In [1]:
import numpy as np
import pandas as pd

In [4]:
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'PERSON':['sam','mom','abs','edr','ghj','rty']
     ,'SALES':['200','120','300','500','600','700']}

In [5]:
df=pd.DataFrame(data)

In [6]:
df

  company PERSON SALES
0    GOOG    sam   200
1    GOOG    mom   120
2    MSFT    abs   300
3    MSFT    edr   500
4      FB    ghj   600
5      FB    rty   700

In [10]:
comp=df.groupby('company')

In [12]:
comp.sum()

         PERSON   SALES
company
FB       ghjrty  600700
GOOG     sammom  200120
MSFT     absedr  300500

In [13]:
df.groupby('company')

In [14]:
comp=df.groupby('company')

In [15]:
comp

In [16]:
comp.sum()

         PERSON   SALES
company
FB       ghjrty  600700
GOOG     sammom  200120
MSFT     absedr  300500

In [17]:
comp.count()

         PERSON  SALES
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [18]:
comp.max()

        PERSON SALES
company
FB         rty   700
GOOG       sam   200
MSFT       edr   500

In [20]:
comp.describe()

        PERSON                  SALES
         count unique  top freq count unique  top freq
company
FB           2      2  ghj    1     2      2  700    1
GOOG         2      2  sam    1     2      2  200    1
MSFT         2      2  edr    1     2      2  300    1